#+begin_src shell 
dir | bb -i '(take 2 *input*)'
echo
#+end_src

#+RESULTS:
| Microsoft                  | Windows | [Version | 6.1.7601] |              |        |        |           |
| Copyright                  | (c)     |     2009 | Microsoft | Corporation. | All    | rights | reserved. |
| d:\dotfiles\babashka>dir   |         |          | bb        | -i           | '(take |      2 | *input*)' |
| d:\dotfiles\babashka>More? |         |          |           |              |        |        |           |

